{
  "badguy1": {
    "Name": "Cantarero Chicas, Jose Gregorio",
    "Date of Birth": "September 20, 1993",
    "Place of Birth": "San Rafael Oriente, San Miguel, El Salvador",
    "Skin Tone": "N/A",
    "Height": "5' 5\"",
    "Weight": "127 lbs",
    "Eyes": "Black",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "N/A",
    "Last Known Location": "N/A",
    "Occupation": "N/A",
    "Reward": "N/A",
    "Wanted For": "Aggravated homicide"
  },
  "badguy2": {
    "Name": "Gonzalez Medina, Jose Orlando",
    "Alias": "N/A",
    "Date of Birth": "April 15, 1986",
    "Place of Birth": "Jucuaran, Usulutan, El Salvador",
    "Skin Tone": "N/A",
    "Height": "5' 6\"",
    "Weight": "132 lbs",
    "Eyes": "Black",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "N/A",
    "Last Known Location": "N/A",
    "Occupation": "N/A",
    "Reward": "N/A",
    "Wanted For": "Aggravated Homicide"
  },
  "badguy3": {
    "Name": "Iraheta, Jose Raul",
    "Date of Birth": "February 5, 1989",
    "Place of Birth": "Jucuaran, Usulutan, El Salvador",
    "Skin Tone": "N/A",
    "Height": "5' 5\"",
    "Weight": "155 lbs",
    "Eyes": "Black",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "N/A",
    "Last Known Location": "N/A",
    "Occupation": "N/A",
    "Wanted For": "Aggravated Homicide"
  },
  "badguy4": {
    "Name": "Quinteros Garay, Cesar Luis",
    "Date of Birth": "November 11, 1993",
    "Place of Birth": "San Rafael Oriente, San Miguel, El Salvador",
    "Skin Tone": "N/A",
    "Height": "5' 1\"",
    "Weight": "121 lbs",
    "Eyes": "Black",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "N/A",
    "Last Known Location": "N/A",
    "Occupation": "N/A",
    "Wanted For": "Membership in terrorist organization (gang)"
  },
  "badguy5": {
    "Name": "Hernandez, Ingrid Estela",
    "Wanted For": "Membership in terrorist organization (gang)",
    "Date of Birth": "September 26, 1986",
    "Place of Birth": "El Transito, San Miguel, El Salvador",
    "Skin Tone": "N/A",
    "Height": "5' 2\"",
    "Weight": "110 lbs",
    "Eyes": "Black",
    "Hair": "Black",
    "Gender": "Female",
    "Scars/Marks": "N/A",
    "Last Known Location": "N/A",
    "Occupation": "N/A"
  },
  "badguy6": {
    "Name": "Fernandez, Guillermo",
    "Alias": "Jose Alvarez-Fernandez",
    "Date of Birth": "February 1, 1994",
    "Place of Birth": "N/A",
    "Skin Tone": "N/A",
    "Height": "5' 3\"",
    "Weight": "140 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "Marijuana leaf tattoo on forearm (unknown arm), last name tattooed on tricep (unknown arm), devil face tattoo on left calf.",
    "Last Known Location": "N/A",
    "Occupation": "N/A",
    "Wanted For": "Murder",
    "details": "Summary: The Montgomery County Sheriff’s Office is seeking the public’s help in locating Guillermo Fernandez aka Jose Alvarez -Fernandez . Mr. Fernandez is wanted by Detectives with the Montgomery County Sheriff’s Office, for the murder that occurred at 23600 block of Goode Road, Cleveland, Texas on August 3, 2017. Mr. Fernandez is considered armed and dangerous and is a documented MS -13 gang member."
  },
  "badguy7": {
    "Name": "Serrano, Jesus Guillermo Alvarado",
    "Alias": "Chungo ",
    "Date of Birth": "January 10, 1999",
    "Place of Birth": "El Salvador",
    "Skin Tone": "N/A",
    "Height": "5' 5\"",
    "Weight": "N/A",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "N/A",
    "Last Known Location": "N/A",
    "Occupation": "N/A",
    "Wanted For": "Membership in terrorist organization (gang)",
    "details": "Person is wanted in El Salvador for the murders of PNC Officers which occurred on August 28,2016."
  },
  "badguy8": {
    "Name": "Bell, Darrick",
    "Alias": "Tone or Ghost",
    "Date of Birth": "December 17, 1968",
    "Place of Birth": "United States",
    "Skin Tone": "Fair",
    "Height": "5'9\"",
    "Weight": "190-200lb",
    "Eyes": "Brown",
    "Hair": "Clean Shaven",
    "Gender": "Male",
    "Scars/Marks": "Chest tattoo",
    "Last Known Location": "Detroit, Michigan",
    "Wanted For": "Human trafficking and narcotics",
    "Occupation": "N/A",
    "Reward": "$16,000",
    "details": "Special agents with U.S. Immigration and Customs Enforcement's (ICE) Homeland Security Investigations (HSI) announced today that the accused leader of a sophisticated human trafficking and narcotics distribution operation in Detroit was added to HSI’s Most Wanted. Darrick Bell, 48, aka Tone or Ghost, a U.S. citizen, is the subject of a months-long manhunt, following the takedown of a large-scale human trafficking operation. Bell and five other defendants were charged in a 9-count indictment with trafficking in persons, forced labor, drug trafficking, money laundering, extortion collection and conspiracy, among other charges. He allegedly absconded before nearly 200 law enforcement personnel descended on the Victory Inn in Detroit Jan. 12, in one the largest human trafficking enforcement operations in the city’s history. The sophisticated operation at the motel allegedly was manned by lookouts and armed enforcers. According to court records, Bell came to the attention of HSI special agents in September 2016, when one of his alleged victims escaped and special agents later confirmed he was operating out of the Victory Inn, which was ordered shuttered by a Wayne County judge in March, citing it as a nuisance. In 2016, the Detroit Police logged more than 115 calls to the location for crimes such as shootings, aggravated assaults and two homicides allegedly linked to former motel guests. The indictment alleges that Bell, along with his co-conspirators, formed and operated a massive human trafficking and narcotics distribution operation out of multiple rooms at the now-shuttered motel. The women were allegedly exploited and abused by forcing them - through threats, coercion and isolation – to work as commercial sex workers for the financial benefit of Bell and other defendants, while a broad range of illegal drugs were allegedly available in other parts of the motel. The investigation revealed the women primarily lived at the motel, where it is alleged they were forced to perform commercial sex acts forced to turn over the proceeds to Bell and his associates. The indictment and other court papers allege that the women gave the co-conspirators 100 percent of their earnings. By adding Tone to the HSI Most Wanted List, we make the world a much smaller place for him to hide, said Steve Francis, HSI Detroit acting special agent in charge. We’re confident that Tone’s capture will empower the survivors of his alleged acts, and embolden others who are facing similar circumstances to come forward, knowing that they will be fully supported and that their captors will face justice. Bell is the primary defendant arrested in the ongoing probe and the seventh charged as a result of the investigation.  Tone is considered armed and dangerous. Member of the public should not try to apprehend him. Anyone with information should contact local law enforcement or the ICE Tip Line at 1-866-DHS-2-ICE, The investigation is being conducted by the multiagency, HSI-led Michigan Human Trafficking and Transnational Crimes Task Force (MT3), housed out of the Taylor Police Department in Taylor, Michigan, and was provided critical support by the Detroit Police 4th Precinct’s Special Operations Unit."
  },
  "badguy9": {
    "Name": "Juarez-Tomas, Esteban",
    "Alias": "Diaz-Gomez, Salvador; Ochoa, Victor; Gomez-Estrada, Edgar",
    "Date of Birth": "September 8, 1983",
    "Place of Birth": "Guatemala",
    "Skin Tone": "Medium",
    "Height": "5'5\"",
    "Weight": "140 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Last Known Location": "Champaign, Illinois",
    "Occupation": "Laborer",
    "Reward": "N/A",
    "Wanted For": "Removal and aggravated DUI",
    "details": "Subject is a 33-year old citizen of Guatemala who is currently wanted by ICE for removal and by Champaign County (Illinois) police for aggravated driving under the influence. In 2017, Juarez was allegedly driving under the influence and struck a vehicle that caused the death of a woman. An immigration judge ordered him removed from the U.S. on January 13, 2003. He has been removed from the U.S. to Guatemala on three separate occasions. His most recent removal was on January 18, 2012. Juarez unlawfully re-entered the U.S. at an unknown date and place without inspection and despite attempts by ICE to locate his whereabouts, he currently remains at-large."
  },
  "badguy10": {
    "Name": "Mario Antunez-Sotelo",
    "Alias": "Antonio Antunez Roman, Antonio Antunez Sotelo, Antonio Antunez, \"El Tony\" or \"Don Tony\"",
    "Date of Birth": "April 9, 1963",
    "Place of Birth": "Mexico",
    "Skin Tone": "Medium",
    "Height": "5' 7\"",
    "Weight": "200 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "Scar above left eye",
    "Last Known Location": "Tijuana, Mexico, or San Diego, California",
    "Occupation": "Handyman",
    "Reward": "N/A",
    "Wanted For": "Human Trafficking",
    "details": "Mario Antunez-Sotelo is wanted in connection with a San Diego, California, human trafficking and alien smuggling event which occurred in 2006. On July 3, 2007, a federal arrest warrant for Antunez-Sotelo was issued in the Southern District of California for human trafficking and alien smuggling violations (U.S. CODE 18 USC 1589 AND 8 USC 1324.) He is believed to be a member of an alien smuggling organization which smuggles undocumented aliens into the United States for financial gain and then compels their labor under threats of harm and death. Antunez-Sotelo is a fugitive and is known to possess firearms. He should be considered armed and dangerous."
  },
  "badguy11": {
    "Name": "Martinez, Jose Melchor",
    "Date of Birth": "January 6, 1970",
    "Place of Birth": "Mexico",
    "Skin Tone": "Medium",
    "Height": "5’7”",
    "Weight": "150 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "Scar on Right Shoulder; Tattoo on Left and Right Shoulder",
    "Last Known Location": "Louisiana",
    "Occupation": "Laborer",
    "Wanted For": "Removal from the Unites States - subject is a convicted sex offender.",
    "details": "Martinez is wanted for removal as a previously removed, convicted criminal alien with a felony conviction in Mecklenburg County, North Carolina, for indecent liberties with a child in November 2002. Martinez was most recently removed to Mexico on September 6, 2003, and unlawfully re-entered the U.S. at an unknown place and date without inspection. Despite numerous attempts by ICE to locate his whereabouts, he currently remains at-large."
  },
  "badguy12": {
    "Name": "Moreira, Santos",
    "Date of Birth": "February 5, 1972",
    "Place of Birth": "Belize",
    "Skin Tone": "Dark",
    "Height": "5'10\"",
    "Weight": "215 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "Scar on left forearm",
    "Last Known Location": "Los Angeles, California",
    "Occupation": "Unknown",
    "Reward": "N/A",
    "Wanted For": "Convicted of manslaughter",
    "details": "Santos Moreira is wanted for removal as a previously removed criminal alien with felony convictions for manslaughter, robbery with a firearm, and possession and purchase of cocaine. Moreira was ordered removed by an immigration judge on November 7, 1995. He has multiple previous removals and was last removed from the U.S. by ICE on October 14, 2010. Moreira unlawfully re-entered the U.S. at an unknown place and date without inspection, and despite attempts by ICE to locate his whereabouts, he currently remains at-large."
  },
  "badguy13": {
    "Name": "Gamez-Trejo, Kristian Jonas  ",
    "Alias": "Gamez-Trejo, Brayan Nain",
    "Date of Birth": "February 12, 1995",
    "Place of Birth": "Honduras",
    "Skin Tone": "Medium",
    "Height": "5' 3\"",
    "Weight": "120 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "Tattoo Left Forearm",
    "Last Known Location": "Oakland, California",
    "Occupation": "Laborer",
    "Wanted For": "Removal from the United States - convicted sex offender",
    "details": "Date of Birth: February 22, 1995 or December 16, 1992. Gamez-Trejo is wanted for removal as a previously removed, convicted criminal alien with a felony conviction in San Francisco County, California, for sex with minor in November 2016. Gamez-Trejo was most recently removed to Honduras on December 9, 2015 and unlawfully re-entered the U.S. at an unknown place and date without inspection. Despite numerous attempts by ICE to locate his whereabouts, he currently remains at-large"
  },
  "badguy14": {
    "Name": "Hernandez Rodriguez, Juan",
    "details": "Juan Hernandez Rodriguez is wanted for removal as a self-admitted gang member and previously removed criminal alien with convictions for burglary and felony grand theft. Hernandez was ordered removed by an immigration judge on August 16, 2006.  He has been removed on five previous occasions to include his most recent removal on October 12, 2012. Hernandez unlawfully re-entered the U.S. at an unknown place and date without inspection, and despite numerous attempts by ICE to locate his whereabouts, he currently remains at-large.",
    "Date of Birth": "February 24, 1984",
    "Place of Birth": "Mexico",
    "Skin Tone": "Medium",
    "Height": "5'6\"",
    "Weight": "160 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "Tattoos on face, abdomen, right arm, left arm and neck",
    "Last Known Location": "Bakersfield, California",
    "Occupation": "Unknown",
    "Reward": "N/A",
    "Wanted For": "Convicted aggravated felon"
  },
  "badguy15": {
    "Name": "Arellano-Gutierrez, Atanacio",
    "Alias": "CAMACHO, Victor; ARELLANO, Tony; GUTIERREZ, Julio; MONTEAGUDO, Julio Rodolfo",
    "Date of Birth": "May 9, 1987",
    "Place of Birth": "Mexico",
    "Skin Tone": "Light/Medium",
    "Height": "5'6\"",
    "Weight": "135 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "“RIP Reyna” tattoo on right forearm; “Carolina” tattoo on upper right arm; L.R.Z. tattoo on right leg; 6 dots tattoo on right index finger",
    "Last Known Location": "Illinois",
    "Occupation": "Unknown",
    "Reward": "N/A",
    "details": "Subject is a 29-year old citizen of Mexico who is currently a previously removed criminal alien wanted for removal. Arellano was convicted of Felony Weapon Offense – Aggravated Discharge of Firearm, Felony Burglary, and Felony Shoplifting. Furthermore, subject is a documented gang member. He was ordered removed by an authorized official on April 24, 2013 and was removed from the U.S. to Mexico on May 1, 2013. Arellano unlawfully reentered the U.S. at an unknown date and despite numerous attempts by ICE to locate his whereabouts, he currently remains at-large.",
    "Wanted For": "Convicted felon wanted for removal from United States"
  },
  "badguy16": {
    "Name": "Chambers, Desmond Hugh",
    "Alias": "Mullings, Warren Michael; Green, Gregory Lemuel",
    "Date of Birth": "August 3, 1963",
    "Place of Birth": "Jamaica",
    "Skin Tone": "Medium",
    "Height": "5’09”",
    "Weight": "170 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "Scar on forehead",
    "Last Known Location": "Maryland, Florida, Georgia",
    "Occupation": "Unknown",
    "Reward": "N/A",
    "details": "Wanted For: Convicted of possession with intent to distribute cocaine, second degree rape, first degree sex offense, false imprisonment; Wanted for Removal from United States"
  },
  "badguy17": {
    "Name": "Chicas-Ramos, Juan Francisco",
    "Date of Birth": "June 2, 1958",
    "Place of Birth": "El Salvador",
    "Skin Tone": "Medium",
    "Height": "5’05”",
    "Weight": "150 lbs",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Wanted For": "Homicide in El Salvador",
    "Last Known Location": "Virginia",
    "Occupation": "Laborer",
    "Reward": "N/A",
    "details": "Subject is a 57-year old citizen of El Salvador, an at-large illegal alien, currently wanted in El Salvador for homicide. It is alleged that in 2012, Chicas along with two other accomplices killed a young man. He is currently the subject of an Interpol Red Notice for the same offense. Chicas unlawfully entered the U.S. in 2014 and despite numerous attempts by ICE to locate his whereabouts, he currently remains at-large."
  },
  "badguy18": {
    "Name": "Mejia, Edwin",
    "Alias": "Eswin Mejia",
    "Date of Birth": "June 3, 1996",
    "Place of Birth": "Honduras",
    "Skin Tone": "Medium",
    "Height": "5' 5\"",
    "Weight": "150 lbs.",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Wanted For": "Motor vehicle homicide",
    "Last Known Location": "Omaha, Nebraska",
    "Occupation": "Unknown",
    "details": "Subject is a 19-year old citizen of Honduras, an at-large illegal alien, currently wanted for motor vehicle homicide. In 2016, Mejia was arrested for felony driving under the influence of liquor, after he struck a vehicle that allegedly caused the death of a young woman. He unlawfully entered the U.S. in 2013 and despite numerous attempts by ICE to locate his whereabouts, he currently remains at-large."
  },
  "badguy19": {
    "Name": "Cux-Jocop, Mike Jonathan",
    "Alias": "CUX, Myke",
    "Date of Birth": "September 3, 1989",
    "Place of Birth": "Guatemala",
    "Skin Tone": "Medium",
    "Height": "5’5”",
    "Weight": "150 lbs.",
    "Eyes": "Brown",
    "Hair": "Black",
    "Gender": "Male",
    "Scars/Marks": "Tattoo on Back \"Wings with Heart\"",
    "Last Known Location": "California",
    "Occupation": "Food Services",
    "details": "Cux-Jocop is wanted for removal as a previously removed, convicted criminal alien with a felony conviction in San Mateo County, California, for sex with minor in August 2013. Cux-Jocop was removed to Guatemala on November 19, 2013 and unlawfully re-entered the U.S. at an unknown place and date without inspection. Despite numerous attempts by ICE to locate his whereabouts, he currently remains at-large.",
    "Wanted For": "Removal from the United States - convicted sex offender"
  },
  "badguy20": {
    "Name": "Agzamov, Sandjar",
    "Date of Birth": "January 1, 1982",
    "Place of Birth": "Uzbekistan",
    "Gender": "Male",
    "Citizenship": "Uzbekistan",
    "Age": 33,
    "Wanted For": "RICO, aggravated identity theft, harboring illegal aliens.",
    "details": "KANSAS CITY, Missouri — In June 2005, U.S. Immigration and Customs Enforcement's (ICE) Homeland Security Investigations (HSI) Kansas City opened an investigation into Giant Labor Solutions (GLS), after receiving information that two Uzbek nationals were operating a labor service business and employing illegal aliens. This HSI-led investigation expanded to include the following agencies: FBI, Department of Labor, Internal Revenue Service, Kansas Department of Revenue, and U.S. Citizenship and Immigration Services. This ad hoc task force pursued the GLS conspiracy for the next four years. GLS was indicted in May 2009 in the Western District of Missouri for forced labor trafficking and fraud in foreign labor contracting, the first application of these statutes in the United States. The principle target of the GLS investigation – Abrorkhodja Askarkhodjaev – and others were arrested in May 2009 in Brooklyn, New York, as he prepared to flee the country. At the same time, more than 40 human trafficking victims were rescued in Kansas City and St. Louis, Missouri; Casper, Wyoming; Panama City, Florida; Fairfax County, Virginia; and Overland Park, Kansas. Three of the indicted members of the conspiracy – Sandjar Agzamov, Nodir Yunusov, and Rustamjon Shukurov – fled from the United States and remain fugitives. In January 2010, a 127-count superseding indictment charged the GLS conspirators with 59 counts of forced labor trafficking and 20 counts of fraud in foreign labor contracting.",
    "See Also": [
      "Yunusov, Nodir",
      "Shukurov, Rustamjon"
    ]
  },
  "badguy21": {
    "Name": "Yunusov, Nodir",
    "Date of Birth": "January 1, 1987",
    "Place of Birth": "Uzbekistan",
    "Citizenship": "Uzbekistan",
    "Age": 28,
    "Charged with": "RICO, forced labor trafficking, fraud in foreign labor contracting.",
    "Gender": "Male",
    "details": "KANSAS CITY, Missouri — In June 2005, U.S. Immigration and Customs Enforcement's (ICE) Homeland Security Investigations (HSI) Kansas City opened an investigation into Giant Labor Solutions (GLS), after receiving information that two Uzbek nationals were operating a labor service business and employing illegal aliens. This HSI-led investigation expanded to include the following agencies: FBI, Department of Labor, Internal Revenue Service, Kansas Department of Revenue, and U.S. Citizenship and Immigration Services. This ad hoc task force pursued the GLS conspiracy for the next four years. GLS was indicted in May 2009 in the Western District of Missouri for forced labor trafficking and fraud in foreign labor contracting, the first application of these statutes in the United States. The principle target of the GLS investigation – Abrorkhodja Askarkhodjaev – and others were arrested in May 2009 in Brooklyn, New York, as he prepared to flee the country. At the same time, more than 40 human trafficking victims were rescued in Kansas City and St. Louis, Missouri; Casper, Wyoming; Panama City, Florida; Fairfax County, Virginia; and Overland Park, Kansas. Three of the indicted members of the conspiracy – Sandjar Agzamov, Nodir Yunusov, and Rustamjon Shukurov – fled from the United States and remain fugitives. In January 2010, a 127-count superseding indictment charged the GLS conspirators with 59 counts of forced labor trafficking and 20 counts of fraud in foreign labor contracting.",
    "See Also": "Shukurov, Rustamjon; Agzamov, Sandjar"
  },
  "badguy22":
  {
    "Name": "Shukurov, Rustamjon",
    "See Also": "Yunusov, Nodir; Agzamov, Sandjar",
    "Citizenship": "Uzbekistan",
    "Age": 33,
    "Charged with": "RICO, forced labor trafficking, fraud in foreign labor contracting.",
    "Date of Birth": "January 1, 1985",
    "Place of Birth": "Uzbekistan",
    "Gender": "Male",
    "details": "KANSAS CITY, Missouri — In June 2005, U.S. Immigration and Customs Enforcement's (ICE) Homeland Security Investigations (HSI) Kansas City opened an investigation into Giant Labor Solutions (GLS), after receiving information that two Uzbek nationals were operating a labor service business and employing illegal aliens. This HSI-led investigation expanded to include the following agencies: FBI, Department of Labor, Internal Revenue Service, Kansas Department of Revenue, and U.S. Citizenship and Immigration Services. This ad hoc task force pursued the GLS conspiracy for the next four years. GLS was indicted in May 2009 in the Western District of Missouri for forced labor trafficking and fraud in foreign labor contracting, the first application of these statutes in the United States. The principle target of the GLS investigation – Abrorkhodja Askarkhodjaev – and others were arrested in May 2009 in Brooklyn, New York, as he prepared to flee the country. At the same time, more than 40 human trafficking victims were rescued in Kansas City and St. Louis, Missouri; Casper, Wyoming; Panama City, Florida; Fairfax County, Virginia; and Overland Park, Kansas. Three of the indicted members of the conspiracy – Sandjar Agzamov, Nodir Yunusov, and Rustamjon Shukurov – fled from the United States and remain fugitives. In January 2010, a 127-count superseding indictment charged the GLS conspirators with 59 counts of forced labor trafficking and 20 counts of fraud in foreign labor contracting."
  },
  "badguy23":
  {
    "Name": "Moore, Jamal",
    "Date of Birth": "January 1, 1984",
    "Place of Birth": "United States",
    "Gender": "Male",
    "Citizenship": "United States",
    "Age": 31,
    "Charged with": "sex trafficking of a minor",
    "details": "MINNEAPOLIS, Minnesota – In August 2012, U.S. Immigration and Customs Enforcement’s (ICE) Homeland Security Investigations (HSI) St. Paul and the Minneapolis Police Department (MPD) responded to a tip about a sexual ad of juvenile girl posted on Backpage.com.  HSI and MPD responded to the tip and recovered the juvenile female victim from a hotel room. Jamal Moore was identified at the hotel room and taken into custody. The victim later stated during an interview that Moore was her trafficker. On Jan. 17, 2013, Moore failed to appear in Minnesota state court, County of Hennepin, for a pre-trial hearing. A bench warrant was issued. He remains a fugitive."
  },
  "badguy24":
  {
    "Name": "Ramirez-Granados, Paulino",
    "Alias": "“Pascual Ramirez” aka “Pato”, aka “Sergio Ramirez-Granados”",
    "Date of Birth": "January 1, 1971",
    "Place of Birth": "Mexico",
    "Gender": "Male",
    "See Also": "Granados-Rendon, Raul",
    "Citizenship": "Mexico",
    "Age": 44,  
    "Charged with": "sex trafficking, alien smuggling, money laundering and conspiracy to import aliens",
    "details": "NEW YORK, New York — In January 2010, U.S. Immigration and Customs Enforcement’s (ICE) Homeland Security Investigations (HSI) New York initiated an investigation into the Granados sex trafficking organization based in San Miguel, Tenancingo, Tlaxcala, Mexico. The investigation began with the referral of a trafficking victim by a nongovernmental organization. The victim had been smuggled into the United States and forced into prostitution in June 2000 by a member of the Granados family. She provided a detailed account of the physical and sexual assaults she suffered by a member of the Granados organization and threats made to the safety of her children when she said she no longer wanted to work as a prostitute. HSI special agents identified and rescued 25 additional victims – all Mexican nationals – and 19 additional traffickers/smugglers, all members or associates of the Granados family. Several victims were sexually assaulted by their traffickers, others were physically assaulted, and all were threatened with harm to their family members. Members of the Granados family would befriend or romance young, uneducated women before pressuring them or coercing them into prostitution in Mexico. The victims were subsequently smuggled into the United States and brought to the New York City area to work as prostitutes. Granados family members would take all money earned by the victims and maintain their hold on them through physical and sexual abuse and threats of harm to their families. Several of the victims had children with their traffickers and have been threatened with the loss if their children if they did not continue to work as prostitutes and earn money for the Granados family. To date, 13 members of the Granados organization have been indicted in the Eastern District of New York on sex trafficking charges. Eleven have been arrested, and two – Paulino Ramirez-Granados and Raul Granados-Rendon – remain fugitives. In June 2014, Antonio Lira-Robles, 38, was sentenced to 15 years imprisonment and ordered to pay restitution in the amount of approximately $1.2 million. Samuel Granados-Hernandez, 33, was sentenced May 2014 to 15 years; Eleuterio Granados-Hernandez was sentenced March 2014 to 22 years; and Angel Cortez-Granados was sentenced September 2013 to 15 years."
  },
  "badguy25":
  {
    "Name": "Granados-Rendon, Raul",
    "See Also": "Ramirez-Granados, Paulino",
    "Date of Birth": "January 1, 1987",
    "Place of Birth": "Mexico",
    "Gender": "Male",
    "Citizenship": "Mexico",
    "Age": 28,
    "Charged with": "sex trafficking, alien smuggling, money laundering and conspiracy to import aliens",
    "details": "NEW YORK, New York — In January 2010, U.S. Immigration and Customs Enforcement’s (ICE) Homeland Security Investigations (HSI) New York initiated an investigation into the Granados sex trafficking organization based in San Miguel, Tenancingo, Tlaxcala, Mexico. The investigation began with the referral of a trafficking victim by a nongovernmental organization. The victim had been smuggled into the United States and forced into prostitution in June 2000 by a member of the Granados family. She provided a detailed account of the physical and sexual assaults she suffered by a member of the Granados organization and threats made to the safety of her children when she said she no longer wanted to work as a prostitute. HSI special agents identified and rescued 25 additional victims – all Mexican nationals – and 19 additional traffickers/smugglers, all members or associates of the Granados family. Several victims were sexually assaulted by their traffickers, others were physically assaulted, and all were threatened with harm to their family members. Members of the Granados family would befriend or romance young, uneducated women before pressuring them or coercing them into prostitution in Mexico. The victims were subsequently smuggled into the United States and brought to the New York City area to work as prostitutes. Granados family members would take all money earned by the victims and maintain their hold on them through physical and sexual abuse and threats of harm to their families. Several of the victims had children with their traffickers and have been threatened with the loss if their children if they did not continue to work as prostitutes and earn money for the Granados family. To date, 13 members of the Granados organization have been indicted in the Eastern District of New York on sex trafficking charges. Eleven have been arrested, and two – Paulino Ramirez-Granados and Raul Granados-Rendon – remain fugitives. In June 2014, Antonio Lira-Robles, 38, was sentenced to 15 years imprisonment and ordered to pay restitution in the amount of approximately $1.2 million. Samuel Granados-Hernandez, 33, was sentenced May 2014 to 15 years; Eleuterio Granados-Hernandez was sentenced March 2014 to 22 years; and Angel Cortez-Granados was sentenced September 2013 to 15 years."
  },
  "badguy26":
  {
    "Name": "Hernandez-Prieto, Eugenio",
    "Date of Birth": "January 1, 1969",
    "Place of Birth": "Mexico",
    "Citizenship": "Mexico",
    "Age": 46,
    "Charged with": "conspiracy to engage in sex trafficking",
    "Gender": "Male",
    "details": "SAVANNAH, Georgia — In January 2013, U.S. Immigration and Customs Enforcement (ICE) announced the results of Operation Dark Night, a large-scale investigation into a sex trafficking ring operating in Florida, Georgia and the Carolinas. The investigation, which was led by ICE's Homeland Security Investigations (HSI) Savannah, led to a takedown of 15 brothels, 13 criminal arrests and the rescue of 12 victims. In February 2014, 24 members of the sex trafficking operation were sentenced, including a life sentence for the ringleader – Joaquin Mendez-Hernandez – and a collective 97 years for the remaining 24 defendants. The victims were ordered to be paid $705,000 in restitution. One fugitive remains in this case – Eugenio Hernandez-Prieto – whose last known address was Tenacingo, Tlaxcala, Mexico."
  },
  "badguy27":
  {
    "Name": "Gutierrez-Marez, Jose Isidro",
    "Alias": "\"Pelon\"",
    "Date of Birth": "January 1, 1961",
    "Place of Birth": "Guatemala",
    "Gender": "Male",
    "Citizenship": "Guatemala",
    "Age": 54,
    "Charged with": "harboring aliens for financial gain",
    "details": "ATLANTA — On June 26, 2012, U.S. Immigration and Customs Enforcement’s (ICE) Homeland Security Investigations (HSI) Atlanta began an investigation into the alleged human trafficking of young women from Latin America to Atlanta for the purpose of prostitution. The HSI investigation, in coordination with the Clayton County Sheriff's Office, led to the identification of a victim working as a prostitute at a residence in Forest Park, Georgia, and of two individuals managing the house. Anselmo Mundo-Salgado, aka Gordo, and Jose Isidro Gutierrez-Marez, aka Pelon, were indicted Oct. 9, 2012, for harboring aliens for the purpose of private financial gain. Mundo-Salgado was arrested and turned over to the U.S. Marshals Service. Gutierrez-Marez fled to Texas and is thought to be living in Mexico."
  },
  "badguy28":
  {
    "Name": "Martinez-Rojas, Severiano",
    "Date of Birth": "January 1, 1966",
    "Place of Birth": "Mexico",
    "Gender": "Male",
    "Citizenship": "Mexico",
    "Age": 49,
    "Charged with": "sex trafficking",
    "details": "ATLANTA – On May 21, 2013, U.S. Immigration and Customs Enforcement’s (ICE) Homeland Security Investigations (HSI) Atlanta and the FBI conducted search and arrest warrants for several individuals suspected of human trafficking. Since 2006, Severiano Martinez-Rojas, along with family members Arturo Rojas-Coyotl, Odilon Martinez-Rojas, Daniel Garcia-Tepal and others, all from Tenancingo, Tlaxcala, Mexico, conspired and brought multiple women into the United States from Mexico and Guatemala, all for the purpose of forcing them to engage in prostitution. Eight victims from Mexico and Guatemala were rescued during the course of the investigation. Odilon Martinez-Rojas and Rojas-Coyotl have been sentenced to 21 years and 16 years in prison, respectively. Severiano Martinez-Rojas is believed to have returned to Mexico prior to the warrant execution and remains a fugitive in this case."
  },
  "badguy29":
  {
    "Name": "Romero-Rugerio, Saul",
    "Date of Birth": "January 1, 1979",
    "Place of Birth": "Mexico",
    "Gender": "Male",
    "Citizenship": "Mexico",
    "Age": 36,
    "Charged with": "sex trafficking",
    "details": "ATLANTA — In August 2008, U.S. Immigration and Customs Enforcement’s (ICE) Homeland Security Investigations (HSI) Atlanta and the FBI rescued eight women who had been smuggled into the United States and forced to engage in prostitution by Saul Romero-Rugerio and his co-conspirators. According to court records, beginning in 2006, Saul conspired with his brother Miguel Angel Romero-Rugerio and Christina Hernandez-Suarez to entice and smuggle young women into the U.S. from Mexico, harbor them and then force them to work in prostitution.  The investigations revealed that Saul romantically pursued his first victim in Mexico in 2007, when she was 17. He convinced her that same year to travel with him to the United States, where he promised to be with her romantically and provide a better life for her. After arriving in the U.S. around August 2007, the victim was forced to work in prostitution. He repeatedly raped and assaulted the victim while she resided with him.  After returning to Mexico in December 2007, Saul met his second victim, a young El Salvadoran female, who was in Mexico attempting to be smuggled in to the U.S. This victim’s smuggler/coyote had recently abandoned her and the rest of their group. Saul told her he could help her travel to the U.S. and find work in Atlanta, and that she could pay him back after she got a job. Saul then took the victim to his home in Mexico where he kept her locked in a bedroom and repeatedly assaulted her physically and sexually. At some point between December 2007 and March 2008, Saul smuggled the second victim into the U.S. and traveled to Atlanta where he continued to assault her and forced her into prostitution. Saul and his co-conspirators are from Tenancingo, Tlaxcala, Mexico. Miguel Romero-Rugerio pleaded guilty to conspiracy to smuggle aliens to engage in prostitution and smuggling aliens to engage in prostitution. He was sentenced to five years in prison in 2010. Hernandez-Suazez is currently incarcerated in Mexico. Saul Romero-Rugerio remains a fugitive in this case."
  }
}