{
  "Name": "Romero-Rugerio, Saul",
  "Date of Birth": "January 1, 1979",
  "Place of Birth": "Mexico",
  "Gender": "Male",
  "Citizenship": "Mexico",
  "Age": 36,
  "Charged with": "sex trafficking",
  "details": "ATLANTA — In August 2008, U.S. Immigration and Customs Enforcement’s (ICE) Homeland Security Investigations (HSI) Atlanta and the FBI rescued eight women who had been smuggled into the United States and forced to engage in prostitution by Saul Romero-Rugerio and his co-conspirators. According to court records, beginning in 2006, Saul conspired with his brother Miguel Angel Romero-Rugerio and Christina Hernandez-Suarez to entice and smuggle young women into the U.S. from Mexico, harbor them and then force them to work in prostitution.  The investigations revealed that Saul romantically pursued his first victim in Mexico in 2007, when she was 17. He convinced her that same year to travel with him to the United States, where he promised to be with her romantically and provide a better life for her. After arriving in the U.S. around August 2007, the victim was forced to work in prostitution. He repeatedly raped and assaulted the victim while she resided with him.  After returning to Mexico in December 2007, Saul met his second victim, a young El Salvadoran female, who was in Mexico attempting to be smuggled in to the U.S. This victim’s smuggler/coyote had recently abandoned her and the rest of their group. Saul told her he could help her travel to the U.S. and find work in Atlanta, and that she could pay him back after she got a job. Saul then took the victim to his home in Mexico where he kept her locked in a bedroom and repeatedly assaulted her physically and sexually. At some point between December 2007 and March 2008, Saul smuggled the second victim into the U.S. and traveled to Atlanta where he continued to assault her and forced her into prostitution. Saul and his co-conspirators are from Tenancingo, Tlaxcala, Mexico. Miguel Romero-Rugerio pleaded guilty to conspiracy to smuggle aliens to engage in prostitution and smuggling aliens to engage in prostitution. He was sentenced to five years in prison in 2010. Hernandez-Suazez is currently incarcerated in Mexico. Saul Romero-Rugerio remains a fugitive in this case."
}