{
  "Name": "Granados-Rendon, Raul",
  "See Also": "Ramirez-Granados, Paulino",
  "Date of Birth": "January 1, 1987",
  "Place of Birth": "Mexico",
  "Gender": "Male",
  "Citizenship": "Mexico",
  "Age": 28,
  "Charged with": "sex trafficking, alien smuggling, money laundering and conspiracy to import aliens",
  "details": "NEW YORK, New York — In January 2010, U.S. Immigration and Customs Enforcement’s (ICE) Homeland Security Investigations (HSI) New York initiated an investigation into the Granados sex trafficking organization based in San Miguel, Tenancingo, Tlaxcala, Mexico. The investigation began with the referral of a trafficking victim by a nongovernmental organization. The victim had been smuggled into the United States and forced into prostitution in June 2000 by a member of the Granados family. She provided a detailed account of the physical and sexual assaults she suffered by a member of the Granados organization and threats made to the safety of her children when she said she no longer wanted to work as a prostitute. HSI special agents identified and rescued 25 additional victims – all Mexican nationals – and 19 additional traffickers/smugglers, all members or associates of the Granados family. Several victims were sexually assaulted by their traffickers, others were physically assaulted, and all were threatened with harm to their family members. Members of the Granados family would befriend or romance young, uneducated women before pressuring them or coercing them into prostitution in Mexico. The victims were subsequently smuggled into the United States and brought to the New York City area to work as prostitutes. Granados family members would take all money earned by the victims and maintain their hold on them through physical and sexual abuse and threats of harm to their families. Several of the victims had children with their traffickers and have been threatened with the loss if their children if they did not continue to work as prostitutes and earn money for the Granados family. To date, 13 members of the Granados organization have been indicted in the Eastern District of New York on sex trafficking charges. Eleven have been arrested, and two – Paulino Ramirez-Granados and Raul Granados-Rendon – remain fugitives. In June 2014, Antonio Lira-Robles, 38, was sentenced to 15 years imprisonment and ordered to pay restitution in the amount of approximately $1.2 million. Samuel Granados-Hernandez, 33, was sentenced May 2014 to 15 years; Eleuterio Granados-Hernandez was sentenced March 2014 to 22 years; and Angel Cortez-Granados was sentenced September 2013 to 15 years."
}